{
  "sections": [
    {
      "title": "Education",
      "entries": [
        {
          "title": "B.Tech in Computer Science (GPA: 9.33)",
          "company": "@Graphic Era Hill University, Dehradun",
          "dates": "October 2022 - Present",
          "bulletPoints": [
            "Currently in the third year of undergraduate studies with a strong focus on software development, AI/ML, and system design.",
            "Engaged in hands-on projects involving real-time applications, full-stack development, and research-based learning.",
            "Actively involved in technical communities, hackathons, and academic showcases."
          ]
        },
        {
          "title": "Class 12th – CBSE (97.4%)",
          "company": "@Grace Academy, Dehradun",
          "dates": "2022",
          "bulletPoints": [
            "Studied core subjects including Physics, Chemistry, Mathematics, and Computer Science.",
            "Graduated with distinction, maintaining academic excellence throughout the year.",
            "Actively participated in coding competitions and school-level technical events."
          ]
        },
        {
          "title": "Class 10th – CBSE (96.6%)",
          "company": "@Grace Academy, Dehradun",
          "dates": "2020",
          "bulletPoints": [
            "Strong foundation in Science and Mathematics along with introductory programming.",
            "Excelled in academics and extracurriculars, earning top scores in school examinations.",
            "Demonstrated early interest in computer science and technology."
          ]
        }
      ]
    },
    {
      "title": "Experience",
      "entries": [
        {
          "title": "Metee - ML Summer School 2025",
          "company": "@Amazon",
          "dates": "August 2025",
          "bulletPoints": [
            "Selected for Amazon’s competitive ML Summer School program focused on core and advanced machine learning concepts.",
            "Gained strong foundations in supervised and unsupervised learning, deep neural networks, and dimensionality reduction.",
            "Learned sequential learning, reinforcement learning, and causal inference with real-world ML perspectives.",
            "Explored Generative AI and Large Language Models (LLMs), including modern architectures and applications.",
            "Engaged in interactive Q&A sessions with Amazon scientists, researchers, and industry experts."
          ]
        },
        {
          "title": "Data Analytics & AI Trainee",
          "company": "@PriceWaterhouse Coopers",
          "dates": "February 2025 - June 2025",
          "bulletPoints": [
            "Completed structured training in data analytics, AI/ML fundamentals, and real-world business problem solving.",
            "Worked hands-on with data pipelines, data preprocessing, model development, and business-oriented analytics use cases.",
            "Applied analytical thinking to derive insights from data while focusing on scalability, ethics, and practical impact.",
            "Collaborated with industry mentors and cross-functional peers on case studies and project-based learning."
          ]
        }
      ]
    }
  ]
}
